Revit 2027 API
FillPattern.SetFillGrid Method
 Sets the fill grid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetFillGrid(
	int gridIdx,
	FillGrid fillGrid
)
Public Sub SetFillGrid (
	gridIdx As Integer,
	fillGrid As FillGrid
)
public:
void SetFillGrid(
	int gridIdx,
	FillGrid^ fillGrid
)
member SetFillGrid :
        gridIdx : int *
        fillGrid : FillGrid -> unit
Parameters
gridIdx Int32
 The index of the fill grid.
fillGrid FillGrid
 The fill grid to be used.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FillPattern Class
Autodesk.Revit.DB Namespace